# Taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# Formulae
brew "cloudflared"
brew "deno"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "gulp-cli"
brew "htop"
brew "hugo"
brew "imagemagick"
brew "neovim"
brew "node"
brew "numi-cli"
brew "pandoc"
brew "pure"
brew "python@3.12"
brew "rcm"
brew "spaceship"
brew "starship"
brew "stripe-cli"
brew "thefuck"
brew "tmux"
brew "wget"
brew "youtube-dl"
brew "yt-dlp"
brew "z"
brew "zplug"
brew "zsh"
brew "zsh-async"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Casks
cask "1password-cli"
cask "calibre"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-monaspace"
cask "little-snitch"
cask "upscayl"

# Other important software (some managed by Homebrew, others not)
cask "anybox"
cask "arc"
cask "archiver"
cask "bartender"
cask "bear"
cask "busycontacts"
cask "capacities"
cask "chatgpt"
cask "cleanshot"
cask "discord"
cask "docker"
cask "dropshare"
cask "figma"
cask "forklift"
cask "github"
cask "google-chrome"
cask "grandperspective"
cask "handbrake"
cask "hookmark"
cask "hyper"
cask "iina"
cask "logseq"
cask "lunar"
cask "macwhisper"
cask "messenger"
cask "mimestream"
cask "mullvadvpn"
cask "notion"
cask "obsidian"
cask "pdf-squeezer"
cask "proxyman"
cask "raycast"
cask "reeder"
cask "slack"
cask "sonos"
cask "soundsource"
cask "tidal"
cask "tailscale"
cask "textsoap"
cask "things"
cask "transmission"
cask "visual-studio-code"
cask "webex"
cask "wifi-explorer"
cask "zed"
cask "iterm2"
cask "zoom"

# Software not available via Homebrew
# Adobe Creative Suite (Acrobat DC, Illustrator, Lightroom CC, Photoshop)
# Artifacts
# Cal
# Clop
# Cubox
# Cursor
# DaisyDisk
# Endel
# Final Cut Pro
# Infuse
# Limitless
# Logic Pro X
# Noun Project
# Numbers
# Ollama
# Pages
# Portal
# Rise
# Rize
# Screen Studio
# Setapp
# Shure
# Things3
# TouchDesigner
# Typist
# Ulysses
# iTermAI
# rcmd
# reMarkable
# stoic
# Node.js global packages (managed by npm)
# astro, cloudflare-cli, contentful-cli, depcheck, eslint, gatsby-cli, ghost-cli, lice, pnpm, postcss-cli, purgecss, sanity, spaceship-prompt, yarn

# Note: Ruby gems are system gems and not typically managed by Brewfile
